<script setup>
import ProjectCard from "./ProjectCard.vue";
const projects = [
  {
    image:
      "https://images.unsplash.com/photo-1586175554766-77513ac248d0?q=80&w=2835&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    title: "Строительство дачного дома",
    description:
      "Добро пожаловать в уютный уголок вашего дачного дома, созданного с любовью и профессионализмом нашей команды! Мы с гордостью представляем нашу последнюю завершенную работу по строительству дачного дома - идеального сочетания комфорта и природной гармонии. Наша команда специалистов заботливо воплотила в жизнь все ваши пожелания, создавая просторное и функциональное пространство, где каждая деталь продумана с особым вниманием к вашему комфорту. От уютной веранды до просторной гостиной, от удобной кухни до уютной спальни - каждая комната наполнена теплом и уютом. Мы гордимся тем, что наш дачный дом стал местом, где вы можете наслаждаться природой, проводить время с семьей и друзьями, отдыхать и заряжаться энергией. Наше стремление к высочайшему качеству и внимание к деталям гарантируют, что ваш новый дом будет радовать вас многие годы. Присоединяйтесь к нашему семейству довольных клиентов и оставайтесь вдохновленными красотой и уютом вашего дачного дома, созданного с нами.",
  },
  {
    image:
      "https://images.unsplash.com/photo-1501876725168-00c445821c9e?q=80&w=2940&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    title: "Ремонт квартиры",
    description:
      "Добро пожаловать в ваш обновленный уголок комфорта! Мы с гордостью представляем нашу работу по ремонту квартиры - идеальное сочетание стиля, функциональности и качества. Наша команда специалистов вложила свое сердце и мастерство в создание пространства, которое будет отражает индивидуальность клиента. От оригинального дизайна до последней отделки - каждая деталь продумана с особым вниманием к вашему комфорту и удовольствию. Мы гордимся тем, что наш ремонт не только преобразил вашу квартиру, но и стал источником радости и вдохновения для вас и вашей семьи. Наше стремление к высочайшему качеству и внимание к деталям гарантируют, что ваше обновленное пространство будет радовать вас многие годы. Присоединяйтесь к нашему семейству довольных клиентов и наслаждайтесь красотой и уютом вашей квартиры, созданными с нами.",
  },
  {
    image:
      "https://images.unsplash.com/photo-1568605114967-8130f3a36994?q=80&w=2940&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    title: "Строительство дачного дома",
    description:
      "Добро пожаловать в уютный уголок вашего дачного дома, созданного с любовью и профессионализмом нашей команды! Мы с гордостью представляем нашу последнюю завершенную работу по строительству дачного дома - идеального сочетания комфорта и природной гармонии. Наша команда специалистов заботливо воплотила в жизнь все ваши пожелания, создавая просторное и функциональное пространство, где каждая деталь продумана с особым вниманием к вашему комфорту. От уютной веранды до просторной гостиной, от удобной кухни до уютной спальни - каждая комната наполнена теплом и уютом. Мы гордимся тем, что наш дачный дом стал местом, где вы можете наслаждаться природой, проводить время с семьей и друзьями, отдыхать и заряжаться энергией. Наше стремление к высочайшему качеству и внимание к деталям гарантируют, что ваш новый дом будет радовать вас многие годы. Присоединяйтесь к нашему семейству довольных клиентов и оставайтесь вдохновленными красотой и уютом вашего дачного дома, созданного с нами.",
  },
];
</script>

<template>
  <Swiper
    :modules="[SwiperNavigation, SwiperPagination]"
    :slides-per-view="1"
    :loop="false"
    :space-between="150"
    :navigation="true"
    :pagination="true"
    :draggable="true"
    :autoplay="{
      delay: 3000,
    }"
  >
    <SwiperSlide v-for="project in projects" :key="project">
      <ProjectCard :projectData="project" />
    </SwiperSlide>
  </Swiper>
</template>

<style lang='scss' >
.services-component {
  .swiper {
    width: 600px;
    height: 300px;
  }
  padding-bottom: 100px;
}
.swiper-pagination {
  bottom: 0px !important;
}

.swiper {
  @apply md:px-[50px] pb-[30px];
}

.swiper-button-prev,
.swiper-button-next {
  position: absolute;
  @apply text-orange-500 hidden md:block;
}

.swiper-wrapper {
  align-items: center;
}

.swiper-pagination-bullet-active {
  @apply bg-orange-500;
}
</style>